{
  "version": "0.4.1",
  "summary": {
    "title": "Learn NPM package json",
    "description": "The Node Package Manager (NPM) is a command-line tool used by developers to share and control modules (or packages) of JavaScript code written for use with Node.js."
  },
  "config": {
    "testRunner": {
      "command": "./node_modules/.bin/mocha",
      "args": {
        "filter": "--grep",
        "tap": "--reporter=mocha-tap-reporter"
      },
      "directory": "coderoad"
    },
    "setup": {
      "commands": [
        "cd coderoad && npm install"
      ],
      "commits": [
        "a99811c863d561190f92b8aac455117407674880",
        "1efa2e74255816a138ea9be998d49a6bdfbd082f"
      ]
    },
    "repo": {
      "uri": "https://github.com/coderoad/fcc-learn-npm",
      "branch": "v0.4.1"
    },
    "dependencies": [
      {
        "name": "node",
        "version": ">=10"
      }
    ],
    "reset": {
      "commands": [
        "echo 'resetting'"
      ]
    }
  },
  "levels": [
    {
      "id": "1",
      "title": "Intro",
      "summary": "Introduction to the package.json",
      "content": "When starting a new project, NPM generates a package.json file. This file lists the package dependencies for your project. Since NPM packages are regularly updated, the package.json file allows you to set specific version numbers for each dependency. This ensures that updates to a package don't break your project.\n\nNPM saves packages in a folder named node_modules. These packages can be installed in two ways:\n\n- globally in a root node_modules folder, accessible by all projects.\n- locally within a project's own node_modules folder, accessible only to that project.\n\nMost developers prefer to install packages local to each project to create a separation between the dependencies of different projects.\n\nThe `package.json` file is the center of any Node.js project or NPM package. It stores information about your project, similar to how the &lt;head&gt; section of an HTML document describes the content of a webpage. It consists of a single JSON object where information is stored in key-value pairs. There are only two required fields; \"name\" and \"version\", but it’s good practice to provide additional information about your project that could be useful to future users or maintainers.\nIf you look at the file tree of your project, you will find the package.json file on the top level of the tree. This is the file that you will be improving in the next couple of challenges.",
      "steps": []
    },
    {
      "id": "2",
      "title": "Author",
      "summary": "Package.json author",
      "content": "One of the most common pieces of information in this file is the `author` field. It specifies who created the project, and can consist of a string or an object with contact or other details. An object is recommended for bigger projects, but a simple string like the following example will do for this project.\n\n```json\n\"author\": \"Jane Doe\",\n```",
      "steps": [
        {
          "id": "2.1",
          "setup": {
            "commands": [
              "npm install"
            ],
            "files": [
              "package.json"
            ],
            "commits": [
              "af2a97be3e4e0fda484913aa14df0d1a34c457a3"
            ]
          },
          "solution": {
            "files": [
              "package.json"
            ],
            "commits": [
              "46794cae9d036c50b673b47363e9429ae331eaf6"
            ]
          },
          "content": "Add your name as the `author` of the project in the package.json file.\n**Note:** Remember that you’re writing JSON, so all field names must use double-quotes (\") and be separated with a comma (,).",
          "hints": [
            "Edit the file `package.json`",
            "Add a property of \"author\" to the object"
          ]
        }
      ]
    },
    {
      "id": "3",
      "title": "Description",
      "summary": "Package.json description",
      "content": "The next part of a good package.json file is the `description` field; where a short, but informative description about your project belongs.\nIf you some day plan to publish a package to NPM, this is the string that should sell your idea to the user when they decide whether to install your package or not. However, that’s not the only use case for the description, it’s a great way to summarize what a project does. It’s just as important in any Node.js project to help other developers, future maintainers or even your future self understand the project quickly.\n\nRegardless of what you plan for your project, a description is definitely recommended.\n\nHere's an example:\n\n```json\n\"description\": \"A project that does something awesome\",\n```",
      "steps": [
        {
          "id": "3.1",
          "setup": {
            "files": [
              "package.json"
            ],
            "commits": [
              "1d2f58330ee9773ac7f80df5a628675fbead1e60"
            ]
          },
          "solution": {
            "files": [
              "package.json"
            ],
            "commits": [
              "ee7a7af1c92693d239528832f2a69859371a147a"
            ]
          },
          "content": "Add a `description` to the package.json file of your project.\n\n**Note:** Remember to use double-quotes for field-names (\") and commas (,) to separate fields.",
          "hints": [
            "Edit the file `package.json`",
            "Add a property of \"description\" to the object"
          ]
        }
      ]
    },
    {
      "id": "4",
      "title": "Keywords",
      "summary": "Package.json keywords",
      "content": "The `keywords` field is where you can describe your project using related keywords.\n\nHere's an example:\n\n```json\n\"keywords\": [ \"descriptive\", \"related\", \"words\" ],\n```\n\nAs you can see, this field is structured as an array of double-quoted strings.",
      "steps": [
        {
          "id": "4.1",
          "setup": {
            "files": [
              "package.json"
            ],
            "commits": [
              "6b8e6ef82ad0cd0dbb0193787c14ed39fe039132"
            ]
          },
          "solution": {
            "files": [
              "package.json"
            ],
            "commits": [
              "b0d6dc4a4dd6b510fcd0b9d803e301049ee574d3"
            ]
          },
          "content": "Add an array of suitable strings to the `keywords` field in the package.json file of your project.\n\nOne of the keywords should be \"freecodecamp\".",
          "hints": [
            "Edit the file `package.json`",
            "\"keywords\" should be an array including the string \"freecodecamp\""
          ]
        }
      ]
    },
    {
      "id": "5",
      "title": "License",
      "summary": "Package.json license",
      "content": "The `license` field is where you inform users of what they are allowed to do with your project.\n\nSome common licenses for open source projects include MIT and BSD. License information is not required, and copyright laws in most countries will give you ownership of what you create by default. However, it’s always a good practice to explicitly state what users can and can’t do. Here's an example of the license field:\n\n```json\n\"license\": \"MIT\",\n```",
      "steps": [
        {
          "id": "5.1",
          "setup": {
            "files": [
              "package.json"
            ],
            "commits": [
              "67346726fb199a390aa9f402ec3a0516fcfeff74"
            ]
          },
          "content": "Fill the `license` field in the package.json file of your project as you find suitable.",
          "solution": {
            "commits": [
              "060c0756282e4efc83435008dff06a5e4ef6943c"
            ]
          }
        }
      ]
    },
    {
      "id": "6",
      "title": "Version",
      "summary": "Package.json version",
      "content": "A `version` is one of the required fields of your package.json file. This field describes the current version of your project. Here's an example:\n\n```json\n\"version\": \"1.2.0\",\n```",
      "steps": [
        {
          "id": "6.1",
          "setup": {
            "files": [
              "package.json"
            ],
            "commits": [
              "dc7f47dbbefb5f18cc5980418912d76096ee4907"
            ]
          },
          "content": "Add a `version` to the package.json file of your project.",
          "solution": {
            "commits": [
              "ad2cb8466d937eb7c03f99fc876b7ab08dd13067"
            ]
          }
        }
      ]
    },
    {
      "id": "7",
      "title": "External Packages",
      "summary": "Installing dependencies from NPM",
      "content": "One of the biggest reasons to use a package manager, is their powerful dependency management. Instead of manually having to make sure that you get all dependencies whenever you set up a project on a new computer, NPM automatically installs everything for you. But how can NPM know exactly what your project needs? Meet the `dependencies` section of your package.json file.\n\nIn this section, packages your project requires are stored using the following format:\n\n```json\n\"dependencies\": {\n  \"package-name\": \"version\",\n  \"express\": \"4.17.0\"\n}\n```\n\nInstall a package by running the NPM command line tool in a terminal with the command `install`.\n\n```shell\nnpm install express\n```\n\n**Note:** Use the Use the `⌃\\`` keyboard shortcut with the backtick character to open the VSCode integrated terminal.\n\nInstalled packages are created in a `node_modules` folder in your project. Avoid editing or changing the node_modules folder or its contents.",
      "steps": [
        {
          "id": "7.1",
          "setup": {
            "files": [
              "package.json"
            ],
            "watchers": [
              "package.json",
              "node_modules/moment"
            ],
            "commits": [
              "c3a72a33bb7b207b22b2dff04c0e01c269990754"
            ]
          },
          "solution": {
            "files": [
              "package.json"
            ],
            "commands": [
              "npm install"
            ],
            "commits": [
              "506f466305b95777a1be518bf91c35831806f21c"
            ]
          },
          "content": "Install the \"moment\" package to the `dependencies` field of your package.json file by running the command line npm install.\n\n**Note:** Moment is a handy library for working with time and dates."
        }
      ]
    },
    {
      "id": "8",
      "title": "Semantic Versioning",
      "summary": "Versioning packages",
      "content": "`Versions` of the npm packages in the dependencies section of your package.json file follow what’s called Semantic Versioning (SemVer), an industry standard for software versioning aiming to make it easier to manage dependencies. Libraries, frameworks or other tools published on npm should use SemVer in order to clearly communicate what kind of changes projects can expect if they update.\n\nKnowing SemVer can be useful when you develop software that uses external dependencies (which you almost always do). One day, your understanding of these numbers will save you from accidentally introducing breaking changes to your project without understanding why things that worked yesterday suddenly don’t work today. This is how Semantic Versioning works according to the official website:\n\n```json\n\"package\": \"MAJOR.MINOR.PATCH\"\n```\n\nThe MAJOR version should increment when you make incompatible API changes.\n\nThe MINOR version should increment when you add functionality in a backwards-compatible manner.\n\nThe PATCH version should increment when you make backwards-compatible bug fixes.\nThis means that PATCHes are bug fixes and MINORs add new features but neither of them break what worked before. Finally, MAJORs add changes that won’t work with earlier versions.\n\nUsing the NPM cli, a specific version of a package can be installed by specifying the `@` version.\n\n```shell\nnpm install express@4.17.0\n```",
      "steps": [
        {
          "id": "8.1",
          "setup": {
            "files": [
              "package.json"
            ],
            "watchers": [
              "package.json",
              "node_modules/moment"
            ],
            "commits": [
              "d75d588947efe26c5a2fe5bfd809da9211f8f2d3"
            ]
          },
          "solution": {
            "files": [
              "package.json"
            ],
            "commands": [
              "npm install"
            ],
            "commits": [
              "c38b20b9c8c5f9d68efa433fc33b715a70060d74"
            ]
          },
          "content": "In the dependencies section of your package.json file, change the `version` of moment to match MAJOR version 2, MINOR version 10 and PATCH version 2"
        }
      ]
    },
    {
      "id": "9",
      "title": "Receive Patch Updates",
      "summary": "Using `~` to recieve patches",
      "content": "In the last challenge, you told npm to only include a specific version of a package. That’s a useful way to freeze your dependencies if you need to make sure that different parts of your project stay compatible with each other. But in most use cases, you don’t want to miss bug fixes since they often include important security patches and (hopefully) don’t break things in doing so.\n\nTo allow an npm dependency to update to the latest PATCH version, you can prefix the dependency’s version with the tilde (`~`) character. Here's an example of how to allow updates to any 1.3.x version.\n\n```json\n\"package\": \"~1.3.8\"\n```",
      "steps": [
        {
          "id": "9.1",
          "setup": {
            "files": [
              "package.json"
            ],
            "commits": [
              "b4f94faaf7ee23103dbdb935083bae86ccf03799"
            ]
          },
          "solution": {
            "files": [
              "package.json"
            ],
            "commits": [
              "35f54899b037b00fdd85f45b0d5d94089cf599f4"
            ]
          },
          "content": "In the package.json file, your current rule for how npm may upgrade moment is to use a specific version (2.10.2). But now, you want to allow the latest 2.10.x version.\nUse the tilde (`~`) character to prefix the version of moment in your dependencies, and allow npm to update it to any new PATCH release.\n\n**Note:** The version numbers themselves should not be changed."
        }
      ]
    },
    {
      "id": "10",
      "title": "Receive Minor Updates",
      "summary": "Using `^` to receive minor updates",
      "content": "Similar to how the tilde we learned about in the last challenge allows npm to install the latest PATCH for a dependency, the caret (`^`) allows npm to install future updates as well. The difference is that the caret will allow both MINOR updates and PATCHes.\n\nYour current version of moment should be \"~2.10.2\" which allows npm to install to the latest 2.10.x version. If you were to use the caret (`^`) as a version prefix instead, npm would be allowed to update to any 2.x.x version.\n\n```json\n\"package\": \"^1.3.8\"\n```\n\nThis would allow updates to any 1.x.x version of the package.",
      "steps": [
        {
          "id": "10.1",
          "setup": {
            "files": [
              "package.json"
            ],
            "commits": [
              "36951e66e83966359d20ece1a362b2bc91e4d722"
            ]
          },
          "solution": {
            "files": [
              "package.json"
            ],
            "commits": [
              "9578b3e8ef7f6c0f03d3e3b9b2b6bdc151e4e186"
            ]
          },
          "content": "Use the caret (`^`) to prefix the version of moment in your dependencies and allow npm to update it to any new MINOR release.\n\n**Note:** The version numbers themselves should not be changed."
        }
      ]
    },
    {
      "id": "11",
      "title": "Remove a Dependency",
      "summary": "Removing a dependency",
      "content": "You have now tested a few ways you can manage dependencies of your project by using the package.json's dependencies section. You have also included external packages by adding them to the file and even told npm what types of versions you want, by using special characters such as the tilde or the caret.\n\nBut what if you want to remove an external package that you no longer need? You might already have guessed it, just remove the corresponding key-value pair for that package from your dependencies.\n\nThis same method applies to removing other fields in your package.json as well.",
      "steps": [
        {
          "id": "11.1",
          "setup": {
            "files": [
              "package.json"
            ],
            "commits": [
              "364e2417076bf8d6604084409404ab9ff7b6533f"
            ]
          },
          "solution": {
            "files": [
              "package.json"
            ],
            "commits": [
              "d3ee6474be0c501136dde32efed480c9f3d8fdbf"
            ]
          },
          "content": "Remove the moment package from your dependencies.\n\n**Note:** Make sure you have the right amount of commas after removing it."
        }
      ]
    }
  ]
}